===============================================================
| Hyperparameters & additional info                             |
===============================================================
|step                          |2                             |
|epochsToTrain                 |25                            |
|maxlen                        |8                             |
|lr                            |0.005                         |
|sentenceLenToGen              |60                            |
|diversities                   |0.2,0.5,1.0,1.2               |
|epCount                       |228                           |
===============================================================


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 128)               524800    
_________________________________________________________________
dense_1 (Dense)              (None, 896)               115584    
_________________________________________________________________
activation_1 (Activation)    (None, 896)               0         
=================================================================
Total params: 640,384
Trainable params: 640,384
Non-trainable params: 0
_________________________________________________________________
