===============================================================
| Hyperparameters & additional info                             |
===============================================================
|step                          |2                             |
|sentenceLenToGen              |60                            |
|epochsToTrain                 |50                            |
|characterToTrainId            |1                             |
|epCount                       |24                            |
|diversities                   |0.2,0.5,1.0,1.2               |
|lr                            |0.005                         |
|characterToTrain              |joey                          |
|maxlen                        |30                            |
===============================================================


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 128)               770048    
_________________________________________________________________
dense_1 (Dense)              (None, 1375)              177375    
_________________________________________________________________
activation_1 (Activation)    (None, 1375)              0         
=================================================================
Total params: 947,423
Trainable params: 947,423
Non-trainable params: 0
_________________________________________________________________
