===============================================================
| Hyperparameters & additional info                             |
===============================================================
|lr                            |0.005                         |
|epochsToTrain                 |50                            |
|maxlen                        |15                            |
|diversities                   |0.2,0.5,1.0,1.2               |
|sentenceLenToGen              |60                            |
|step                          |5                             |
|epCount                       |100                           |
===============================================================


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 128)               263680    
_________________________________________________________________
dense_1 (Dense)              (None, 386)               49794     
_________________________________________________________________
activation_1 (Activation)    (None, 386)               0         
=================================================================
Total params: 313,474
Trainable params: 313,474
Non-trainable params: 0
_________________________________________________________________
