===============================================================
| Hyperparameters & additional info                             |
===============================================================
|lr                            |0.005                         |
|diversities                   |0.2,0.5,1.0,1.2               |
|maxlen                        |30                            |
|characterToTrainId            |4                             |
|step                          |2                             |
|epCount                       |24                            |
|epochsToTrain                 |50                            |
|characterToTrain              |joey                          |
|sentenceLenToGen              |60                            |
===============================================================


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 128)               827904    
_________________________________________________________________
dense_1 (Dense)              (None, 1488)              191952    
_________________________________________________________________
activation_1 (Activation)    (None, 1488)              0         
=================================================================
Total params: 1,019,856
Trainable params: 1,019,856
Non-trainable params: 0
_________________________________________________________________
