===============================================================
| Hyperparameters & additional info                             |
===============================================================
|epochsToTrain                 |25                            |
|sentenceLenToGen              |60                            |
|lr                            |0.005                         |
|step                          |4                             |
|maxlen                        |16                            |
|epCount                       |50                            |
|diversities                   |0.2,0.5,1.0,1.2               |
===============================================================


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 128)               174080    
_________________________________________________________________
dense_1 (Dense)              (None, 211)               27219     
_________________________________________________________________
activation_1 (Activation)    (None, 211)               0         
=================================================================
Total params: 201,299
Trainable params: 201,299
Non-trainable params: 0
_________________________________________________________________
