===============================================================
| Hyperparameters & additional info                             |
===============================================================
|diversities                   |0.2,0.5,1.0,1.2               |
|epochsToTrain                 |50                            |
|sentenceLenToGen              |60                            |
|lr                            |0.005                         |
|characterToTrain              |joey                          |
|step                          |3                             |
|characterToTrainId            |4                             |
|epCount                       |24                            |
|maxlen                        |15                            |
===============================================================


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 128)               2877952   
_________________________________________________________________
dense_1 (Dense)              (None, 5492)              708468    
_________________________________________________________________
activation_1 (Activation)    (None, 5492)              0         
=================================================================
Total params: 3,586,420
Trainable params: 3,586,420
Non-trainable params: 0
_________________________________________________________________
